Revit 2024 API
DocumentDifference.GetModifiedElementIds Method
 Modified element id collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetModifiedElementIds()
Visual Basic
Public Function GetModifiedElementIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetModifiedElementIds()
See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace